{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "main_input",
          0,
          0
        ],
        [
          "aux_input",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              50,
              6
            ],
            "dtype": "float32",
            "name": "main_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "main_input"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              30
            ],
            "name": "conv1d_1",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_1"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              10
            ],
            "name": "conv1d_2",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_2"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              4
            ],
            "name": "conv1d_3",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_3"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "filters": 11,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0,
                "l2": 0.009999999776482582
              }
            },
            "kernel_size": [
              1
            ],
            "name": "conv1d_4",
            "padding": "valid",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "main_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv1d_4"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_1",
            "padding": "valid",
            "pool_size": [
              21
            ],
            "strides": [
              21
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_1"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_2",
            "padding": "valid",
            "pool_size": [
              41
            ],
            "strides": [
              41
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_2"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_3",
            "padding": "valid",
            "pool_size": [
              47
            ],
            "strides": [
              47
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_3"
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling1d_4",
            "padding": "valid",
            "pool_size": [
              50
            ],
            "strides": [
              50
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv1d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling1d_4"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling1d_1",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_2",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_3",
                0,
                0,
                {}
              ],
              [
                "max_pooling1d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_1"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_1"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32",
            "name": "aux_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "aux_input"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ],
              [
                "aux_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 20,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 15,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_3",
            "trainable": true,
            "units": 10,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_3"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_4",
            "trainable": true,
            "units": 1,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_4"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_4",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "45322a748e5f61493311f7f7796bc585122fd61cc7b0f2bd7cc1650b592a863d",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      1,
      50,
      6
    ],
    [
      1,
      1,
      1,
      1,
      2
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            1,
            50,
            6
          ],
          "values": [
            "AzndP9xORz4G1sW+nsVfPx/vFj9phsQ+4Nn5P4c1qj6/1O29Atagv9S5AECaGwy+9ruIv0xC/L9t1j+8C/xgvj6uBsBvifg/huo8Pkt/zj6mMmm/6WysPZZQ3L+8aDE//7EYv4Xeuj5kCFa+llwvuwQUyD7CQoW+DbgXwNUBur2N/Qa/y8MwP+TRuj3JWUO/NTuhPkFryr8xbYG/SLdVP8mdpD81U1W/0gp9vjcxbD447A4/hD+qP0kDfj89tYu/Cs6kPsCPmT/hn9Q+u7pMvxQ/Cz+O3c4/QoQ6P6DieD/MVmS/wmRbP6AuiL7U7Kc/qk1ivhtWRT4ykN6+iWGSP1Hv2D+/GM6+VsFiPoTGiL+9808/VffIv2B1T79MdPA9Uoppvn6yaL/zjmY/7C3lPsd7G7+aEOU+WkgGveKssD7EOaE/GbS0v0+S3b7R6No+4E2YPlFCLb+tlg+/z0wZvnUUub9pYBI/XzOfvgu8ij/FDS6++FhTP8QKmL4oZOm+hJk1vZJkOsApsIg/bykuP4Z/x78ZBzw/zCnEv3dRZ7932yU/dANOv++FkD8w1ou+Z/E4PoUCR7+SrwjA2hQpP7sx87/8sDg9hOMcPzAEub+Ncx5AIIkFP8rotT7Eyl+/TFFJP0ANzr87GEk/Cn6uP0H4FT/ceBXADNhxP/t/Pb6o+0c/0r//PqWdoL9iVZc/6RBfP0gqvT9fH70+Hj+hP7PRj78YrU2/a8eePtVxyj59+zs/zT05wPMw7D6W4Iw+yW1QPkaYir+nN2O/qUIEP6JPHkBgfce9s5pJv7ejRD7NAYe/sMCav0to3D9qhiI/voPcP4Iim7//XvU/++uSPRTUSb+lQNI+FJSEPoS+mb4PIJI+DuNTPu/21z0rzHE/OmboPreakz8Lypc/bBVtP64szL/8lKM+9BfPPpVQsD9AfqK+XF4CQOYB0j3brY69/YtxPwYDDL/cxWW7UikXP/T8PL+Ah2Y+4FKQP1AUNb5UZAa/wu2QvQ2fsr41MZM/",
            "wEfiv9Ie075FGWG85OSqP97Cjb/iUJW+obiev5n4kj9O4Ym/fcLkProuUr5ms6++ZWlaPvr0bL4Dng6+Llj9v1rU2D8opu4/tJSBv2fFpD4fSgG/XCKJv3yPOr914qO/vm6Lvy/QyT+o+Bg/8x0fv3oU6D9T6WM/byqEP4AFL7/Dm2y/+PxvvwRKQb0odjW/j2TAP4dg9j7Vn0+/ApylP3CL5z6PWuG+X0OsvwtNoj/eOn4/gIKSPnP/fr+FlZe/ipvtPuzKWj8A6kC+kXMYvB3Tf76cPzW9+W/PP1x18T9q6ZG/VY5Zv2Vtr77fdQ++jsmvv080db9ACfC/K07mPmoRf7/kWxK/VcC8vYpuVj8ugpE9oa4UPddiV79ZrSi+buFrP/4XUL+5J4y/Zhqcvzoulb4PbA0/vVKZvwMDmr9+mpu/OLOyvpv04z7mG+k9/KRovx0wdj+XC5w/r4UzwGSHuj7o05a/eHQWv5ltGD89AIG/g4f1PhovcL9xSuC/ss1vP8L5DL+OEYM/a1ITvmHSU78VGSY+FYGnPnEvTL9NN9+/Eja1PRHNH0BHsoC9"
          ]
        },
        {
          "shape": [
            1,
            1,
            1,
            1,
            2
          ],
          "values": [
            "llcDPtWtGL4="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1,
            1,
            1
          ],
          "values": [
            "SiJaPg=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "conv1d_1": {
      "bias": [
        "BW2+PKZFzDypPq87/9w0u6LsfbzfZhY5VXbHuzR0i7sSCTu8JuLhPJCUmTw="
      ],
      "weights": [
        "fpoKum8rCDsphkI7POy/OzxfOTrWOhY6L1mguUI/DDsKvzA78fOjO+YMYTokyYS4rif7t9BOBDul5hw70eGHOxsFkDrkqiq6PnQ+OcqE3jrqOBg7WbBOO5ERlTr2+oK60WGBOYBNpzpFMg8712onO0VmkzouK5269gc2OQP1cTpd6As7a9UHO7SInjqQt6u6hUFZOfb5SDpCcQw7PjoSOxFxvDrlTqG6aKn4OXqDYTrH5NA6UggOO2gL/zrszWS6LS2gOsoQrDoam4k6wKXaOoGbLTspZeW5xGEDO0rU0DpIJk86EyikOAVUfDuccNQ4ZcEBO/4/3DrEu0U6vVULu5o8rTu7iSc6TxGtOuoE9DrCcLY65uZQu970qTtk1GQ6o3NaOmpPBzvw1zg7LWY6u3lyWTtiCKw6J3elOtgJHTssC4g7ZGT2uhG1ATua6gg7D9wrO7L2ATsCOX07MZILu6RhUDvF9z47ofsqO5pfsTrVaH07x9mtu2EEtDuIUqY77KVVuiNiwzpczdQ7kATsu6YJwjsl2AA8mUPxuj06ETuLMwo83gihu/mJxTt/5wk8K9oEOuyw4DoEoUg8JMc4u8TuFjvh2+A7QXAmOz7GArvKb2M8QgyNu870C7s+TMM70E+aO3pTp7vOyvY7UXHYu/OALTthbXg7jbhpOx9rX7ps7dK6U9KGu7/54jtOJbw5Pl8iuZrv3DsGNAG7ZrWMt4xH7zu8L/465Oo8Oay5Ijyvrr87VY0Ku3TnLDyZQc07dIuJOxHVijvDNhE8waILvJFzoTvNe8079j2UO0y6absJUNg68HofvCzd67rBLoE5LYblOjqxA7uhuwO7S4vUu9g6lDn2BfO68oJFunH3PTqohQq6EASAu1c1SToRoY060Yy8umIpNDnevBa6jmwtu5GbUTqyzJg6vNfFuctrbbpcCbE4HhsUu4UhbjoSgzI6LXNSPKGKxLuKKWw71WkcvK0uebtILh689iGXOxhTJjo3CM+7HzkTvKuiWbt5Zfu7",
        "ZcB/Ovv8Tzs6C3e7bCcPO3l1kLsOq8W77V8sO8W8wrpvBiY7qZY+PILWL7vhktW7aenxO4BWwzvpg3a7cxQDvA9frruWjq67KelUu3rIfDq6LBa8JA6jO1AKxrsnmsG7qPnBO7N7bTtXO966+9jSOwfuBrzdRrC6t+1oOW9OzjvAkre7ibQkOwlcB7wN5oS7ECpkOxi4iDt2bh+7a7ARu+oiBbzYKJA5uKvYO5mrk7qizY67cmlWO1M/srvZi5Q7fyKrOpIOnTvNJ4e8pmKmu9QhizoiItU75SQLPHACqTv2qDu8Ga1Yu6ipEjoxaqw79C9bOzfq3ru4ojS7v0GHOwbzUjsY/gs8GSYwPEqRiLv+V4a788TuOzSIgjs264U7CnVDPP20hrut/Ca8E+POO2LaZbmaE4g7j6YEu8eZZ7t8hEm8w9uBO7in5TqRFUE8ED9ItzXxeDrReN67SQ1fu0T8mrp/wWE8KicRvEeLVjsEBaQ6Bl09PCjTGrv2upg7LZC4u7T50Tt+6za7uWsYO8Tl6LoQ4a67Ex5bu57OqTw/Q1m5rUPTOlBwN7sTFLi66uJOu4Q5hTxNz8I7jGAiPNalaLqxMRA7kIcEPNQQHDwqeF+7USZqO2PGiLvHKx67nEr8O1j+tjt19sq7rIr6uVq2LLuN55w64xsnPO15WjvhUcU7C5OmO83ceruobmg7QpNxOT4glbsMyig7wkNwPIL3DLyeQpa7fc0JO6jb7DvzPJC8prqOPEJ/FrvVSre70vjfufHCojpmaAW8psV0O0L7Jjv56Hs6ifJIPMFrC7t+GkC8ChTHuCBdLDqLLEi7CFIRPB8v9buAPoa8KVnDPDNdmbrwmkK7geltO4xyK7whMB27BXucPJmeRjzahb87PLyjOobzPTk7ZOG6zUkwOlpmU7vEvVs4YjiiOrreTzqK06W6Sf9yOrYLU7tODy06wgegOqASsjouLLW660FQOlHyU7txUo06simSOix9iDof7BO7znxwujKKQ7tKYqg6",
        "jUFqOqSzmDnAQku7RMcfu8KnPrt6NnM6/6g9OiEZBboKUHG7tZE3u3BxR7slmAs6S4+SOjKl1bqudpy7BeNiuy9cGLsMB3Q61NeGOmziQrvn/p+7sV97uxAKT7oLO6o6C9k+OjiSg7snjRi7Of8xu/o9NziKfbI66+uJOoy6jrtz8b06cWOsurDBTbnS6946NKr8Oj8vl7safSA7DqVKOlo0Z7oTY6I6IccgO4CIjLtCpDg6K55lO4dpebqBPik5zqISO0Qv87ryCua5JizAOxPscjqTOYG5/gLUOtx0pzqw6JI2CLHhO1kxGjv2icU44sINub4VIDsMXQu7TfCsOziHNztmxgM6FTZFu3RA7Tqh26K7WhFfOwiHSDu7Gee4OhaTu9x8BjuEaIi7od4ZO1eIejuOfqC6v+VCu8MNHTuR8i+6USusOk/RgDsDHru5htCEOYeylLpvjHA71X5XusLqOztKMZY6rQyWOqdmtru5WGc72BIPuyEWwDpylhC6qrolu9Ukq7swbaM6xmAOuZNLOzq+dT27We9Lu9G+w7nzEBA7qjCiOzpiIzpNs3K6EV9kOq77dTumwBA7VE0MPJ18l7rPbR87GNRHO5FthDsoz6e6avrcO4si/bpViHs7XDrJOih5NDsOrba7Q459Owkp1DqI/Us7ssgOOUz81zpbCba7ZXYVO2TwozteR7A6t/JWOlRTv7niKsm6Rd/qOiIIiDtEEXU5flxwOqAl1bqxPDk6zSa2OpwMTTtgXAO4t1miuv7kWro+jr46IjkZOqrWZTuXiCs5LwZ6u+8AtjruOaU6FOTQuajOHTv25uM4W5GoCODW6og6t/0IgSUSiRWuVAgQq/EG7LX1CCbVgohdA0WJquALCWAUT4YuVggJTmCxCED4doYza7mIK+cvCY1hagmu4zwJR97+CLxqNgmwFSqJARGSh8p1O4lZ5NwHBBNciIUbBwmMhCqJRtLJCFBlPokFXfAIfjhJiK80awdU4vyIui0biS20PYnIXjqJ",
        "FJAdCdJI5AfsoB0JCFE0BmoLOAgmB5SIqkzPiIzjBwmvZCIJ6k0giXdFmwjk/9wIxXxZCP7zPYmvUueIPELqCIDmZAkmfScIOR4OCdeS4oj2WzgHzFsfCVR69ggsOhOJG7EZCXYSWwnes+oIuxa2CIbDEokcpf0ID2J2iAujGgm9sACJE+wbCS6jFwneEtWI15XqCC//cwkqUxUJEAgOiUX/FAmIHBkJBLrXB48RKwiKZDgJEMSeiKiGpQibQyKJv3kaB5Yxu4gv4Q2JEHOwCIInNgkKUMEINiNBCCmUBAmpSV0J0BE4CTLTnwjpn6MIraC8CPWwVwh2IYiIeDLhCBVaBgdT8aaIz6xvCdBH74hoSWgIm5lAicjzJol4twoJqbIMCaKVtYiXEBEJq8tQCVsEcYlXQWsJSoqrh0R9vYgjAi0J1PKwCNgdoYg2pfgIx+oPiYeYioiU9y2JAon2iNjjgAi6dLEIDSAYCRNB3ohQ8KWHOG+6CDGljAgmiiAJaoQCiI5nVwnt/2AJvNVKCfMYoIi8BTgJFOkciJO+dgh2qDkJHScwCXoIzIhLZwAJ+7IdicXDqggh0hGJ1Iq/hzuEbQmtw0uIowTliLiGyIgIXCMJnowIiPoz+4g8u+uIeQVxB4xXX4kvcWMJFXHeCNOEpQiwIgQJZ19QCUzFqYamtosGE4wfiZBOtIjAeViJ+PgjCfRs5Ygzy/4IkvLth2X/vYj8SvQHdSkficYhHQnRcQyJIhTxCJTKDYm0ztYI8wCduwOTt7os9tQ750V5PGe0GDuGAJM7+xsrusDzLDopTls7hFv7OhqBLjt/NyU7YDv5ufQEoToxxbG7UBskuzsRjjt2bb25AeGJuznSMjuwjj27CGWQugQFdjvWY6G6K8FEu4O3njk1y3k7tTLEOzZ4Kzs5qzK7YaxaOnTxxjqCVW87xn9JO87Luzr7npi7sBFLufu6GLsWsJU3uVggOqQqLrjY7Im722POu3iTjrrdFpO7XVRUu/OQgLn4tIi7",
        "IxwyuxrfUDl9t1O6lIqWu16rrznugpG7OFkSuiqlIDvUNEC7ioaau3gVljojpZq6hP+RONi59zq+GO86SXB3u5thszsRjVm7QXL/OT78RLoeEjs7MXUEvAULBDzSpTo6eFExO0s+ajv+I8M6oRwkvMrYHjyyIa86S8aIOzb2a7o1DKw7pjwpvMog8TsX/rc7gODNuvJ89rrTU7I5ilZWvFiiszuvTPU7OTBNuZTbW7uJgJA7iEGCvPQXITuW09U75hYMu2UeDDvgudc7PJpvvDCSMTucvr46IrTtuxaLzzvVNBA8+NJlvPv3tjp0Pkm6hiKauxTCxrkSeYw8zx2ovBH9sboqbj876EOOOsONNTtSpY88vxyjvKM4oTuWzCg8SL9tOhFR+jouTt08RCh4vLhMpDvF+1U8TszkOst28ruKh+k86kCku1nzKjxN8JY81FfGuyDqR7yhwhY8TGmdvPYLoTvi8kM8oBtaO0gUBrz4/F+7h+iwvGTEIDygr547Hd42PDQBgDkscd+7bmn6u5OJIzyOlqW7/5cAPGtSkDzyPE88VusnvHe56ztfcT48w9oVPFeRBbsGygU8jazFvDtDTDyzen08lg9pO3/aE7zFopg74B2vvO1khDsaSCa7OxbVuwH1pjtWURG8z1mVvGfc6ThA00m71YieunP00DtQpiY7j/qHvBLRBLr5+5a6ftc+u7d147qY6Ls68rQfPLk407sIchg7+L9Nu7Vhwrr9YbI6KeokPFooxrsGI0478eQNu0+Mrro228u5TSwePKWKkLtG6Uo7+I8Gu34Y7Lo6A9G6TIIaPH0pMLsuQ0I7U4Qjuw9dy7rVC0W62K7lO4811bp0dyQ7IOQpuyUvjbqesLa6heK7O8u1kbp8OPE6oNIsu7G7urr3CRa6/hG9O/ydkLpW1sA6HfQOu2YVpbq0Qhe6DUCgO4cWqrqao7U66ZChulV7XbrrIA26tTSrOzIQuLoB/+86niQ8uivkZLp0Qow3M6ibO5onsboQ2Ps6",
        "F3Cxusx9trq3s2o5139gO4o/pbripMo6zhnNuiKan7oRLgU6GPlnO5+nrLpfiQc6dZD2uSRNULrxya26emJrOxKfSbrtVGG6GLcAugP1ibqMoCS7v92lOksC8Tk2Wpu6FV4+OoDe2TmO1Tu7i6khuw8iNzvl1tE4G2ipudVvwjrhvs+6agqWu5co4jtYrII6TC9hu+YYQLm+vTy6lPx4u6JpEzwusDo7pew4u/wuertkvGi6SIRAu97n9Tu8T5g7ztrzOtewzrskp4G7SYfJu8cn6TtG4L47MvisO5P/l7sG10u7fLoNvB8YHDxR7vk7IEafO9c2LDoS2ck722PTu3b1JDxF5yI8w9FfO2scpDv9bp08pUe2u6Zp6jsSt1I8b3yoOpTazDrU4NU8xgo5vD7DpjfDiAw81WG3OgEXRLv8WpY8SP1kvNMynLqojdI6rJgUPK0V97oTiyA8yfdbvMMR0jvmt0s6XynWOyQL+znk/7g7pZwUvHqx6DuF4BM7Uo2xu9jerzuQg8S4VrAfu1u2FTydj4U7XQBWvG7n3TsYiRO7+3Fju5lufDxVGaY7TjhWvPNwsDsUsp452yoYvM6c+Tt5Yic7yF3Lu0p/hTrC8Iu7rr52vPTm+7rMTRa7EqwOiaSn+YihkgCJ0pwFiQzgAAnnwLyI7NMBCcgT+YitagKJ41wECWTdz4j4xNiIuQ38CAwl+IhgcgEJ6ykAifVk3Yg9puyI+vX8CBud8IivdwGJXwwECWir2oht+suIzsX7iAsf+IhjEPyImf8ACbtt/wiwtLSIKe72CDOOAQm4TgeJIE8BiXRN3IgtT/kIcA/xiP7H8YiKbPSImWT7CDg59Yg7NfwIr737iJif84gC7f6IRxwUCW8MwIjBRNOI/yfviKzN+gifIAAJ5CsHCShHzYjg/9mIdHPziI9G8IiYdPqIs/3ziKlS64hayPYIv+EFifHH/ojHn/6IHgEDCb3z0oidevkIL2cCieBF+4iiq/uIVpwCCRF1zIjpuOCI",
        "n7v0iN6Z9whW5wKJLpL2iCod7Yht1wIJr9D3iJVw7IhAnAEJD1D1iDBK3ojJ8eOICCf5iHto6YhRggiJczIDCbaF2IjnLPGI7ur5iNV18wh1PveI0goGCZy58wjjMQEJO9j1iELg84j69wSJDWkDCTHnzojeZ/UICmkACaSY/4iNt/uIKyoFifRC2ohQRPwIP2cDCfPU/Ig8qQEJjDoOCVru3IikDASJ4HMBCU5p/4jlNfSI4Vb5iO+a6IgUSA4JHnH/CEuS7ojvYvuIEewACb1j9Iga3gSJlEP9iFKRCgm6DvOIKRnyiDF47IhIIvOIMcsEid5z7Yhk8PKIKI70iJYf94jczfqIsPUFCR1x/oj61gmJV7D/CDh794gABwCJub4FiU7h/Ig4Yv+IlDvqiJRT9ojSgfwIEOz8iNwC+ojBJwMJVqrviNF2/AimO/+Ikm72CPFg8IjeNQqJ9bEFCYLd7oj0dfcI4PYACfYD7oiowgQJFB/9iN0o/4jOYwAJyo38CDYfBQmeigUJ/ef3iOWq/AjyL/wIOXvwiHKWAglXvwOJJZgACZgICQnUjfwIzkEMiV7mCokaPgiJ6fsKCeA6ColbgBCJTEcKiUCAEIlv8Q2JDHQJCemqDIkrow2JnMkKiZCwDYkKNSIJ/LwLCdczC4ljuQ+J79YHiR57DomB4Q2J1LIPCTLVCInYCg+JV1sNiQRsD4mEgQyJTLIFCZysB4kfYg+JvsAKiXdnFIlJtwiJ+iIPCRlwB4nhhw2JLG8NiSwRComLLQ2JljcRiYRzCIksZxCJm50KiU0MCYmIOAiJiVEQib9aD4mk0hCJxJsHidE/CIkzDgmJFcEKiWG5D4kW7BCJ4FgPid/HDImH1AaJDnYIiSi1DQnVwRCJ5V8XCdpsDonhkgaJZ64HiVanBQlmiQ0JQYQUiSOiCQn4yg2JRo0EiXa9BAklfAgJR0wMiTVMCwkOBQgJ4xIEiSWhAQnu9QcJ5fUMiTd+BglDcAgJbj4CiY/NBwnKKAAJ",
        "Xi4LiUGyCImkTwIJTIoHifrrBAmZi/8Icq8GiTBcA4nTfAQJ1ekFiZ16EAmQZwcJln8ICfUqBYmXYgmJSxgKiaJmBgkk0goJ2uQGCXjyF4mgswOJHDS4DMnwAQn0iQQJpFENiQSvCQnpWxCJfxEuj6D+AQkXEAEJFoEFidJlBglr1wMJaQXViSmdAwm6nwYJ/FwFiaRQDQmxMgkJhyIFiS5xAwmAzQ+JMKQFiaBpD4k4vhsJ2iACiZaxComfLgKJ3IYGifcdB4nEoQwJnZ4AiWfxBIlJ1QCJHWkFiWbQBYkhDw4J1CQHid77B4k3MgaJomYHidI6CYlYzw0J22oIidspCYmL+guJCpYNiTrhC4lcDwmJ2HMJifcMBIlSKwyJyV4JiWpcCIkdBQuJcDUFibdRBol3SQqJnM0GiY1tC4k31Q+JsPQJiRjzB4ms+QmJtX8RicwZB4mOwgiJzd8DiZYUCInTaQiJdDwQCeJPD4liug6JUAQDiR5dAoll/wWJ0C3WiCdowIewW1yJCx9TCbgiYwiEdJwIViDgiJtcHgla4REJyc9mBxCJjgjle0CJyNBHiQn2+ggx8psINtXqCDdpJwmZDokIIyTjCBeIJYkBlTgJjnmlh4dEQom1LJkH2urLCHYx24eABhcJ0vtyiF3zv4jQzdoGRBEZhyDBj4g87gOIFIBeiE4gIglV6A6J7cjDCNAjD4i9zmeJMmZwiVzRVYkIPqCIu9eciPUhNonKkCkJJrsdCZGAOwmQW7SI3sYiCZ4M+Qez1AUJ8s08iCNiXQkNZc8IBbwWCSTkjAifLGMI5UMsB1KEfQjO+rKI5kVliV/yKohYVgiHPmIECUQeK4mHTSIJFkFuiYQyG4mrf0CIlsFtCSEWZQcewlKJW4FoiZoErAjkdZUIwK26iK8c1IiCkjKJKF9ZBh0noYjzqJWIES8DiN5tjQgckf6IP4N8CAXJQohIiaiI3LY5h3vNTAlULgkJihGeiEs2Tgh+qe4HzDMjCdLO44jjB5YI",
        "OEtViSpkvIclGs4HAO7+iGEdGggGuQUJ/1wHCavTbIk5TR6JamvsCAsHDIkyaxYIDftCCXJXPQlmtliJeWwjCZnSCYgW0igJsJl7iL90iQjSh2MJmtEOidHwqggT0g4IFJqRCCnsPgcgU2UJ2sRrCTtVCIlycZIIPiKYiBpl9YbOE5QIZnJLiZvh9Qg9vh2IVcLiCNJJg4gdJeCIm7dhiQSDnYbKcbsIUQRTidO6dofw8j+J3FwuicTV+4aiBqII1gZnCH9+rAj7PhUJyBjVCKIKxIh2N9eIdxMViaB0lYgEAjyJ9NgUidXv3YgksjEJOj0siZK3DweW+H0IOe7piD6O+4gHb5MILsD9CFDOzggG34GIQP4pieKnsocDj3MJ0hWOB622F4hsVAmJuLqMCOwu3gh2bq+H5twRCagQ/wjCrYQIAlA4Cd1z9YjY6CCJUbccO8OuubjNblq6DCTwuuSyMDsXb+853OLyOhyJxblB5aa6ybGluqSNCjvTM1I6A9mhOklsZrnyC7a6LMiKumRbtDpvYpI6NmOYOspvArk0lLq6p1iRunJICDpBU546TsOpOvOcRrlL5+m61NHOuDd+srjKwIM6jiuYOhsdD7nGr8O6CNJ9uWzbl7kIjlE6KxhnOi3IX7mPKNy6pVacOhmcy7m2dCo6YrktOim+QTllyRq7jBIbO/TaBrodfiw6SVBBOv+1iDquNAi7vCk9O26oeboYfd454x9xOg/hATtlTcO6KiKCO4iJALu87gK57JezOrP/NjtUCRa6dVJjO6N1Pru1dcG5QA6NOmt5XjsGJra6RQRVOwtiZLuHbDe6rLQAO95fmDtXoc66A8BxO4O2XrvYYpa5nlsyO4ROoDv7IQa7P1qCO+N5n7pbc8E60EcfOybzbTv6JhK7aysmO/6R5TqtQUI7QlEDO3tmuzq3AE+7JckAOyERUDsNlGo7pmwlO3SgnjpP8rW7Wki8O+nJbDv6CMk7R7MLO5+WLLtWyqK7s/bJO3D2lzsBsvc7",
        "zQy5uWJ+IbwG8Pu6Rux1us08lzug1N06y0eWu/yLKrzTzKC7yAC8OUOiMrq+GvG71Q3nu3glcLvhcKC7mBIYPDWscruRn2u7Cqq+uw+3ajnoTua67GA7PLDJ/TmjZ247QEdZOWyWJrrFPp851dL2O/j+XTvfJIA7N5/EO6S5FDv/BdE67bEMPLEHcTvgYsC5kM+GO0rM2zt4Bl07Q+oIPFrfiDtX+xg69TIuOW3A0jtIocw7irv0O0CInTsBWS47Zh2UOnqnvTsFqhg8MWzuO3vc8DoNUqI7EK5hO4TFrDvB5uI7IS3BO7yLTDm1l6U7ODGCO//vPjvg2vk72s2JO19SuTpOOYI7rDGOOzQPPjtS+wk844WmOyW5xzowUoo7RNSTOz3k5roU81W7UgRqu37MkzhAtFG8zmRdO341ZbtEExa6dXM7ux9VibrdMze84kvLOkf7JrvAdn66OPvkuhetE7ukJxS869kLO+jyUrtJFrW7QJ2uuhrtZbtDxuO7DZo9O0JvZ7vT8RK7B2eYuwr8nrvozJ67Zk2oOi4rkLsECZa7tAKJu3kJtbuH3ka7bS9nO/fzhbulNae7JEMfucuctbut6Vy6bkRCO4rvdbsHY+e7xJ5aOl3pqbvVVLc5IDrUOqT+NLsbFKy7xZVNu95QlLuo8Qg7272UO3Imgrr4ns67R1+pOmCFgrtt1nM7hu7UOl6vnjpI58q7c4qhOxrBa7seH4k7x/SKO9kLsDl4nvu7xq6lO1MmQrvjAnc7mJraOmaaWTjDamC7hg+nO59/SLv5cVQ7UJhGO0E+OTuAOL27D2UeO9jUPrvuQUo7IJ4KO3vbdzv990m7I7qeO7sXQrvg4aw78CE8Oh2UxDqIUl+7G+MZO6uuUbtf1c47Zk3ZOrWjuDqBWOK7dlwtO19NgLtAbYs7RuDcOqZ+Crs/9AK8spTAOqh6CroNmDg7KPy5O88hlLuA8Bu8NvsiOb8WcDs5JKA6dLtYO+PiC7zJBCm8RP0KOb9c4zu7PRE7",
        "oMQDu+STULxbuWu81M+wuRjD4zth6bQ6v3CAOw9pYLzMPPG7TPCEO0j9njtpcLK7gGs3PBJnubtHAaq7+sQ4PJxi/DsDLia8cFjDO/57tLoOORy8B9IpPFHkFzyzFw28tbt4u4X7r7vNddq760ZLOx2iADz5fKc6NGnUu0kGdruD5xM8no6jOnq5djkOK146uIUTvMe/qzsAA546zwcoPENEk7tM6EC7zvoevNTwJTx07jA81+i0PLEegTq+Dis7tsCVuY0WADxv7+g7lxrgPAhhi7urOc07DyjUO//l0zq3fVS5zgrRPFGoBry2z8c7"
      ]
    },
    "conv1d_2": {
      "bias": [
        "CD5tPWylHrz1zes8s+AoPRB0nryW07Y8OjR6u+Y1AbpVIjg5vJqzvLhOFDw="
      ],
      "weights": [
        "2hekue44UDtBxfo68NsrO80Urzoekr66trbIORAjgztTlzM7h8mLO/rknDrdgNI50NfPOiYzVDt5NBY7EGCJO4cRh7pFJJ06jZe/OlsTUDvq1mw66+lzO3gH0LpDDLU6T6biOr0eYztDnBg66HpfO2tbPDhvSwc783U+O6HEMjvDCGA6fRogOy/QrzoAfBs7Upp6O1ZR2ToaU8Y6TF65OqIfyjrDwAA7s/t7O1neoTofyg87UfFDOusCujoYJME6sbtDOxr2lzqmrC07UcQkOnOtvzpemq466aMTO/r1rTrzXCk7FkLhOiWb4jrmuco68UIJCQuDAwnsgQ8Jds8PiXNVDYlHPgyJ0XEIiXKjCAlZcw+JTXAIiXMoBgmkyAiJIqMLict9AwkFqwgJa0wFCVD6AIkC8gqJc50LiZqoBgmqWAWJFf4RCUvUColGBwuJl+MGCfGbCAmlKw0JM2UHCUNMBYnQqAaJnbkMiR7uBomqngiJGlwNiQgOBwmjAAaJGg8FiZifCokKmQyJAHsFCSSnCgnktwaJDfMCic7LD4k6HgoJOOACCUc7CgkWUwwJfucFiYxoCgl22AcJF4gCia98EQmtqwWJZIYKiQUY/4inigOJCnIFiZiiBIkbXw8JO21Qu/KLj7qD69Q6oVgSu/8I+7nOBoe7WnaIu0Bz3jo06E06+lTGOjhdGLoKBta6vFPht/hgWjurOCw7Kbm2O54HDTqPFg47w15oO6h7MDu5ySQ7+6umO4ARlzk8wxw7HXJFO66UcjvAJ9Y5UdleO+/r+7mRF3A6KdUMOuUDtjt23BQ5EPpIO4QOvjrb8685coOcOdjepTvDflQ7Iz/NOuAbsTpZmEM6SrIqO3azETt2PJM7ai8cuhcEGjpXjio6g9dwO8RtdrmfmIM77ew5ujxE6zp0LJs6ZD8eO0arrjnvy4Q7t/6GOpiuJTtL/CQ7KR3ouJ+MibpN/is8XU8IO4vWQDtGZsW6+0+eO2KhNjtZ5S083s6fOyCg1Tpi9Vo7",
        "6ZPjO8DCpju1luc7KsATPGZPpDvzz7A7eM5OO5IM+juUvVw7KRXOO1MkqjsygrE7vubPuk//KDy+n446fEa2O4O/kTuaRJY7hQ+jutPfAjw7NAc7VPOUO7ew3zuNujI7r7k2OwOviTthFNs7IxR9O61/vzvzyfs6s2aRO8RCSjpRcgQ8tYF1Owu6hTv017I6nTOPO1Z/jToUyuw7uT2KO1wZnjt7zOc6fj56O/BpuTvQ8b47vo6SOxxGdztOtDA7DPoGCWIADonqHgiJiyQNCSMfCYmEUAWJqNUGCa4iCYng+hCJfe0JibKqCgkwDAiJ3AcMCZ9zEAmU4gmJmT0KCegFCwnGoAaJNKQFCXSlA4lsrRSJ1okVidtXDwmflwqJyJMNiQEXAIlMDQ6J/Z0OiXYcFAllNQiJCHQLiToPConZPw+JTtsFCe2iD4lLlQmJFsoHiRGvEwnq/QgJnJEJCc8EGglP5AuJv14OCXOXCYn7aQ4JHtQfidraC4kOgQqJ9h8LCdpnEwmfNwmJNiwHCaEUBImd3giJXdcLCSXHCAn09ggJXcsKCSfrCYnGLRIJhB9QuxK6zTvjusI7NNQ3PFXsFLutUjG7FkiaO8pNMTukZZ074X4YPH9tZ7vOM8e7bIWlO9AnmDvLaLw6+VySOwEEkLvBjQK8qP7TOq024zvfjQo7Om83O6pp9boDNoO7wwGCOth2sTt+YWU7dcSzuiLQjDmTGic5U9iXO4zWTzv2s2I6dxKRu5BTsjpArIG1uhKhO/O7BDsvoYw73gCBu99n3zoqV2i6KgQNOzQeYzoMhs87ybQGu+eVADugCPK47yYqOwE4ojrLgLU7cMA8Ovswpzqgcas5Z5RDOzy3XztccQI7LcWSOqXEhjr3AXO6g2KjOyqgwbrX3IO6+u+hu6ewETw9yy28SHehusfEC7uSkjW7uNxkvJgiBjwVCQG87Jeou5QxozrrqNe6ofiUvMlYVDxkpZm7ZlnkuwKX+jlLkLK6iIN6vBM6aTyyH407",
        "L20Wu/WAk7tuSbQ78cOPvDH4kTwSRDs85VC8uRUdbbvwSlO62UiXvDHlpDyDffo7zfeCO7whBDssbdQ7cwAQvL67UzwSroE7gNyMOacgtjr0G/k83YmAvDmHX7tbYDg8vWsOvIbnvDu3epc8I4eLvId1z7umx747SHDSO6uT6zsSlR48pBqkvA/4ujqySh47MM8jiILjCgguw1GIDNsahnCZGggwK1WI2BdHiA2DbQl+96uIj0hECSeLHQcnBYiIGhhzh+hPKQnay8aIMOcDCVXt8QjUEwaI9hSUBjhQAQkV/5iIwJhiiH19IIcccoEIzoM8iFKFEgkNUGyITU3WiJiVNIgA/rYDaye7hyazBQgPjG6I2HbxiCP+YodqGD+INkyMh46Tqoi2MLiISJbliMeGCAi2DpWICW67h6Vg04iA+q6IOuTeiCzrjAgm+oWIrGwpiJot3IhHR7iIJkHAiD5dEQmdDKiHHYqEiEdvtIhhmaSI8vIGB0u2kAiY3isJqQqNO5IPPDwiUmQ8n+Syu/x6BTybKlw8dDZsPOJDTTwf60s86zzEvGV9pDt//pE8Qg5jPEh6FDxmbGw8r9oMvR3m8DtvsD08clR+vHc6BDwMPgY803DVvMrVMzz0qE26LWmmvDl/oTusAw+8lD+UvMV9iztxW6W7QTkYu+zhILnWWOU6pmFrvP/YzLvMCgi8z1rKO0/PB7zmR9E7BKJevDC4Abx+Zue7B1/burwpGLw01c88L0ehubs3VTzaWxO73A2uu2jUZjvajiA8BPHCu+6yLDwU3JW63xyVuxjCoTtg61e7HWWcvJWfA7w04tc4ODIhu7Rku7ulE0U8+vJYu1pkMDun8lA8tMyVOTGJ1LtYRj07ylp2PC4fUzzisCw8N+F7u+PELruxvjW60WkZPJKYMTxlFVI8DNs0vE3XCbs6KnC8Ky3VOxKR8LnJK5E38xlwvA/98Dqro1i6iwA2PG9Fizud3Hm7+nnRu0JruTtOOJc8CS/bO/O0BDxjKZU7",
        "JjAMPIwirDtbidY7SR8CvBcpLrwyXv06btcgPCDGljuoz8G7AXKnvKJBvLwrGjC8SwjUOkPI8Tu5L7C7fU7evFd0g7w1C0K84/P2uYltszlRqgS8h365vG1g27u27aW7nuCaO0sLJrx8hV870rCHu9WROru/54y7VswjOxXs67uFF+u6GMvkujJ9T7sCBvW7f5YLu3iUZLrpWxi7MgFTO1pAUjkCeg+7LgtduneX5DqU2zs7WhDMOx7EYjtlLHg7xlAOO82JCzta6986967BOxRUyDoMqVs7W7j5OuQ5sDtbihq7OqqZOz32prqkO0I6VXW0ujTo7zvzmL+5/qmCO1ZVhjoeOLA5fJ8nuyXQsTtGsb07Gj80Ow6FKzs+ZAg7/zB8OgcDqzoi/ZA75hEUO8+MUjtUEB87ZZC2O5l7Nroys+86K98qO6TgnTv4eYA7"
      ]
    },
    "conv1d_3": {
      "bias": [
        "I5vkPKPm0jxeR4i8hqIqPMvQDDsmAhW7AAAAAEZ7Aj08NrU9RmIQPV7u7Dw="
      ],
      "weights": [
        "eDIsO83uBzzAh+I7Jv0xPGwSKju72Oc7tXGhO2jsnDuKZ/I7prEKPN2Ze7mM3SA7frbOOsqtGjySzIw4cx+NO1WJ/Lr0+O86uySwukGJPDx2dVQ7ibjAO0uLVDu01aE7VishvAe1p7w1bDw8h7ZfvDUvujslRaK69saNvNJtdbzg2rS8OVjKO0g5zzvu6IE8k9cFvVF5eTmlYsk86ZUWPDn78jwyPAi8nPmpuwdkzTvlXCM9sLZzPRsKHrxoMYG8zfoIiaCs/IgsvAmJbf8NCWTZAwn7WgcJ3e0NiWKxCInOKAWJt5UJCRsmDIlV1gOJBUsJib6jCgmU8AWJhGQXiRgpC4kkngYJS1sCiVOlDgmsWQ8Jah8ECeZ1BwnaoQ0J4jRuOhahBDp4Mvk7cW/+u5C53DsDVgE8KKWJuiIKXztFHko8ArwEvK5/6Dsjrdk7W5ZPu9fBNTv1WUA8BXAVvOaU9rnvkMg7TO2Iu7n3MbmLVA48pMEyvK5lW7oPGco75A7iOXSeyDuBGic8oU8yvPxZBzyDNQ88XmoNvPQDezuuhg08+UsxvFMM4DoYx447u6YOvMEisbhyukw7v0P6u+mAHDsokYY76htWO392gTnZXR86Vcnsu6kkIjwklaY7twhrCOYfpwZH0/sIhuRnCAqS9AgRirYIQlaHCBHlAAkf0xUJAwBKhzYjxAhh8PcI6qHCCFkcNAkJSi0J0wUFCDFwLAjgIgAJKgjYCN0ebwl4SCcJADZICRiBkoaFmcUIim08iRVj/oj+P8cILY/7iE7Sz4gF8qkIaCBYCVz29oggB9wH0lrWiK3O/oifGjwJTb7CiAa+jIhTSQEJiFL3iBYYF4kZ1PeIET0AiSP05Qgrhv0IWtD9iI24+oifY+IIGyFePIw2NrzFSrE7HuW5uyANBzpcnIW77Fb8Ozr45rvWaxm6LIAmOjPmirsMYC28dbhTu4MB3LqI0NS67bGAOTh5gztyrMi7ogcWO9xhmLjSwas7srARPJMUNDwKVzO7",
        "/5oAO9H/GTsvTDY7+6UNun+hATvRFIQ4qi8QO4L2kzq1x/465seyN9IxIDpYxzi7Y29DOmHT+Tq58Tc7t2VQOurjQrpV8yG75uAeuRNnFTsac1c7FcpgOkoRBbvOWQ65wJjdOU10jrvIjni7PLzWOkx5t7rE0wm4ahYgu2XSBrsgY467J3g9O4j1GLvRU+K6PKjmux7fQ7tcmpS7QvMPO7enLztFXMC6+Lmqu2nsx7tU6qq4uiimO/oTaTsZpVO629sYut3zrjstfaI6nbWEOzFS8Trqln07QIVQO2aiZzsaGpU70uJEOxHqezoliRk7PzGfO0sZFDtpMtc5p4qWO64Se7sLk4C6FhDYOmbmtjsL2QM6te8JPJaQE7tYnK86"
      ]
    },
    "conv1d_4": {
      "bias": [
        "b+rPu2Wie7wK0Ag94KvYPAVOcrz199c7hgciPOn8Drkh2Fa9MmuuOnjya7w="
      ],
      "weights": [
        "9qQ3iH+oUgjA+q6IPqEsiPw4Iwk74daIHvwaOu4h2jsP09Q8dH0TvMf7MTsBdjo8ox9VO/46cTueHkI7mPIOu/u6vDtDWjQ84TU9O8nhnDt/mq07E4NkPMtkQjoSyA08HTv8uoZPyburfAa7PAKfu2dd1zwwwS88F1gKO7yshjslMoI8jK2iuzK0urrku7E7JbjqO6XXlzvGPQY9IebAuy8TBToi6l88i7lFuMeKL7dsGUW5I12CuIenUrgUxFO4+ygAiTo0/QjMyf6IN8kBicm4Awky6/KI3nfdOhKgIDta/dY8kHnHu5rAUDzBbVg7AqHpOzcyLTx7PsI7a3OZu04e3TuKni88"
      ]
    },
    "dense_1": {
      "bias": [
        "P36/uwB1KT3hq6Y8K/wpPRd/GD3cnoI8uvfzO+bhyjxnpNM8Jy0pvN6mIjy9Bug8ZLQJvW4BNL0AAAAA5XWEOxdX7rsBPUI9AAAAANLd1Dw="
      ],
      "weights": [
        "PrNNPbg6hT4SZ1M+I1OwO5XCmD6P0Mg9634OPpwMf74YgL68zGD1PaQmTz7t2oM8vHqmvslBfz3Mdwa+7/yhvgCjqD4L+a+9XFDCvXBn+T084BW+5qDevWEqiT62JWo+eFHPPJKG+rxCVoM8gPnvvQP4sD7BrGG8XeervjENOj60SUu9o/4lvgPvkr5qnLA+WMuSvlEqYD3AUVS+ahe3PoOo572lqOw9v+kvPR3YhL07+UG+uxaSvXO5l73cbFe+C3RXPquikr5Xrvm9ct7hvXvCVD5UBHq+phJ0vk4YR73dLw28DgJLvgxHWT43Eka+aFxQvehjDz7EKYG83Jl0vhKCjb5ZOtC7JK0+vgohOL7eQoy+gIw3u01amT0YHM89NPgavt/1kr42LI8+m5QXPtNdUb5Tt2i+DAyOPmBCaL4NkKQ+hKivvjlOYz1vbOm+GgFMvrX7cD4c8TQ+KT3Wvkgmmz22Q5m+TVoFPo4gCz5thxW+WHHWPZAaWb0RUlq+ClKmPj4MBT0utzM+WpMcvmw/oD5aVp8+EE8+PQuyZ77FMia9eoQ4Pv+cYD0f5CO87VK4PTfylLuFl6k9n8YtvmPwpb7aCGy+xjRXvt0+T77En7M+hOwUPsznsD3Z6b+93Yg/O3kuqL6bjDi+vKJcPuy3Ib5OQgK+IFR6vpnQfL5WdKC+HB+RPme7Rjwwoo49asoJvujpdb00bxk+E2iMPbZQ37zbdRQ+YJX1vYz9PLulFu69lzwbPmN6aDvahJi+xOp5vjZuCr0zJxO8k93evVC9Dz6JQ3M+cHhkvtj5ajz/yZK+k5MIvk+IgL4hnOk9FxyZPi9emDzBWIi+EGKevSCH/73CplM+MO7xvTikbD7gPWS8CSNovfYLT77Abii9hGQ/vqDMJjx6T4W+tDzevaARz7wAL9I6Wt1xvsYELT7NYKk9MIqBPsrXor1/bP88v6yPvsmjaT0N4US+Z1yHPu6sbj5OSIo+vdx/PswIiT7ZZ9o9zgWoPfB2sz2QOHy+",
        "AVDXPYjKoD3yqh0+UPv6vZx49r2yz769kO/MvPrQUz7r9ns8WOLzvQ1wVT6Jbqc966WjvsN4wr1U9wu+sL7UvQCQZj50+wQ+JmqpvvIz875NtDa+kDbqPYwnJj45UfC99jK4vlHjiz1wLVe9EGRQvfpjlj3JrJC8UNtnPqgtnz7p50C+o7/QPD6PsL1fqFu+f0Nxvt4P671/M5E+MMDrPYYxnL5C5V2+FPmAPt8P9D0xGhu+Y6qTPrQWKb4Lgpo+YdoWPgOigT3SSUy93OpzPtCJXD5qKv+99vJIvlg5pD2hrRG+QHWPvTolLr6wXo8+5xC+O3QZbz6Du4C+zcEtPgrZob26TY+9OC8gvrVPiL6pS/48YD99vtPcpb12sp+9CB/+vXeOEzy7RSo+NPiKvtnAhz7lwl29a/CUPoPuJT0PA20+/To9vjD3Bz654HC+rumFvmobxD2Im5Q+9VebPpb3Dj5vm6I+kUElPtxk6D0ElHM+ZpFovuFSlb4VZF6+4kaZPuS+uz0ELYs+tHy8PQyKbr58+Y2+q1oTvuMN4z1VPyU+aZb4PHyRcj73vmQ++9LUPNjFlT3mFYI+iH1AvncMmL77SWe+OIdJvUpLpL0oRam9AH27O6/bJ76PYjk+G+KDPmxo8r0IbE4+irJyvW8kwDv6Cry8Fk+aPhoOjz2LuTW++sB1PlLRkL2Q/AU+RNL1vX92OL6fs5s+wiU4vRI2J75iaj0+fgQHvgElkz6p13A+dD6KvkIVhr4jvKK9mCGivYyjEL1oMxS9GrZJPlQJCz/gmTA9r0XFvR/pzb69Z2a9POooPj3s773anRO/t6XRvc/5ybyZyPW9TP66PP4vAL7P4H29YHwOPgwVhb6QClU+cgQdvZQ9kT5epcy+/rdGPX2bNL4fv6y9I0RJvuAX9T3qMJ0+2UOSviCc2z0dMYa+5dWYvttZoD5EK5S9jLyUPcnBk76AAV89Oux+PkL+h75gmLi9ZPOHPmvThj4zf5U+XI2kvtmTITxqzz2+",
        "k1P+PSRl/D4AVFY+y/DTvipFyz1xj0i+PFnmPoX3jz0WDZ++fk6bvgDl1rz+lgm+JxaqPrBq0j2ELYc+0PF3vf27dT5U4qG+RmCUvgpMWL0mEF0+j6kIPxeD4T47q3s9Tix/vhFwjr6uPcs+669wPiAhzzyUAsY9wNVFvIy1q745MwE/mNPvPkgzkr49pS2+ssLzPFufyj3CsIQ+/GwVPYbQRTxppou+4Rcqvl9APj77r0w9BunPveruAz7HSoM75EyivsdqHz7OhBI+9VGRPgIwmT2Xh1O7UH+WPZ9j8j0e2vM9F2fWPXe3ajs3PgA+bPPNuuX/Aj0W8tU9dVuCvRDxhT3bRJM9/CYiPoPu0L3iW1A+r0JqOzULiL7aCig+5HCDvndrhD07Fzy+qr14Pqvoq74DLXM+l606PtOuqj5Ug5a+k7JHvtA+Hj4jFDQ+TTKEPpgehz3xnma+wwJtvgailb4dSo2+7+WCvtIdlj7FxKs9pP0JvlDKmL5Dopg+2ROnvXfrr76wq1Q7sEijvnVuJ770WIE9rES1vZgnZ709YB+8GFwZvj98QD4rHWg+tJtxPlYtRb72Yh2+BjpYPjzAlD6qGe29cGwovePXQT7ohAC+wZyEvL/bnr6mG4e97DhcvTxjjT4mZU8+vy99vmuPeT7iaHQ+1W4JPbL5pz7eqpy+D8UwvnTSRj5ilw6+9aaCPv1EXj0Q4O+9GrOFPa1P3j2EFmU9ZwUmvlXIbb6zZ1K+jOYgvXv6iT6lROS+/a7zvUeXWj2ASaA8kB4wPZjEBT67rlU+Fm1Fvjbycr4DFJE+PKOYPgCZ8rxgCiI+XTmLviyZQT6nD4y+iqRLPh2P0b1RDIY8JhxjPjx+r70xm1a+3qkFvSc/MT0fJxe80l9CvkI6KD4KC1C+m3uYPgVrgb7iklk+8PJkPQDOkr5Q+RA+UJWLPpQAfT6sDFY+hnJfvnBSaD6QaCU9IsZcvsx1Pz4AsS+70DGvvZgC9L0ESHE+WulkvkTEqT2N1Qm+",
        "kMRaPjBobz4GOD6+eN0YvRjziD6s54s+bSU9PujuZD6SbHA9NZUsvs7CDbxjtwM8Tx99vS+Ij77VIca8LC4rvd+YTr2/g6m+eGEpvbavg77WIIu+0O+ePuQjRD5HIiU+yPBLPpWEej7G/d+9ZtcMPnDWRzt6rWA9z3l7PQ9Aiz5f1Pq7/9UFviElnT4HgRk+vLzrPTDORT4aEpM+QBW2vOESMDxdla481qzgvRJklD6V98+9BBkmvv18CL6z31q9xoU9PqzrGD1PfZo+5VwVPvIT1j2rGOE98yhWPubVfj7Wfae+YBYlPjxJwD1GTLa9qd2ZvkOgTL6gFlM8M6NwPjbbKL61yYM+nRJiPhoILb4Vclk+en2gvVHmjL7a/k8+7SUyvuqKEb7K/mk+oLE3vmYpEb7Y/kg9+uXkvR0XfD6zKUW+BsajPoRJ5b1d7Ks+wPklvnzEAT6UT7+9kJUUPngnNb0A6nY8DiA9PgxU9r3iXNG9gvSGPnxUlT7OGok+uByYvro9iD5AJCW9PO95viz6Tr4QtCe9AAVUOwiuaD4IYKs+h/LgPV0fLz077Ji+EFWmPHg9yLu7+xe+oLyevp7Uwz21CF++1BilPr+nBz5CWj28WfVUPkIZL77mSo097tQvPqh2Ujyo5hg+EN29vfycUD7kK1M+ayw0PC58cj7oh5+9yxCiPg9air6etN482fFHu4uBxD0oaGK+ilsoPWPjDz7aN1u+hO+GPnyT/rwtH1o+PzxtPu+KH74o1bi9HEzbvDaFUr0YUH2+D5+BPjnIbb4va5M+SAlKvqUymb6wa/k9cmRNvhn/Gz0IcH6+GyaVvei1cL4A4pm9R9wQvXI/Br4+X4+9yx4svibndj7vOYw++RKcvgiQvT0r2K++UOMhPIEe3j7xsUu9jVpCPYnddr6M1Je98VRfPr8BhL7YFI4+qU+MvdzSHL5mB6W9GW4SPnGXvL0AkEs+yR45vr4p7rwnrwU+hS0Lvroh57z4bKE9G4KDPrxWOL7nDli+",
        "Q8y7Pc0M8D3E+cI+TqsGPiJkI76IP5K9hO9ivdj2Cr5dVv27NJTHPZD8zT2zXEK+y1rLvQ3uID5Ah62+aXFNPoAHOT5BrnQ+M98bvu7Qtr1ICrg9haijPJKwIT0WOfi9XrCVvqLl/LvECG4+nt9lPeDMoj5Tho0+5GYYvsKHqr5FNVe+jucyPn/iPD682Sy+ktpMvrJiA74lOkO+rYDFPYnCST2A/JS+bseOPelAjD4f9jo+v6kavj+XBr4u0Vy8pAYuvqU51z35hjm+1lqLvuKTNb54DDI+h1VrvtdtDT7GY7m9/U+JvdDANz0EXUk+F00GPjp30b2Ln3s+EJJxPj3Ycb6wXyA+YEiBPp2bY71+jL49LSopvgRIWb1OOXs+wfFYPam2CL6G85C+LtjuPT/u57y0Y0A+ZGdYPsqkDL7h12++LN8FvkA69r2XFQU8se2FPRxs+T2NdJe+BciAvhZUoj4ZLZ8+YG3bvdkLsj2OTh0+LpqUvokNt73omJu+w1e0vsJiHb4PQOg9XfqTvo/GWT6Tt2M+A+t0PBfbcL7FU5y9CF+OvowUaD5H2wg+KxNoPhYJ2j2wbUy943jzvPLiFz7Ajji+5pFrvhYdwj048co9KmbhvaZmd76xZKy9auk/PUw4n73Bj1A+hXNyPrLsFT6M33w+FKK9PZG0dr4HkK+9uFOWvYIZRb5W6IO+krsWPifePb7yyCK+dH0fPihwdL5mKmk8DQvePLqfmD5foEg+vJJrvpapUzzEXom++aioPK8Oor10h3i+Ck1SPnbvVz4JMYe+NJWvPXKAbz0="
      ]
    },
    "dense_2": {
      "bias": [
        "o5SLu+i4pzvMdnI8//YePcRYfz15CYU82wz+OoIyDj2boZ06X5fCu4Uyf7z/Zj87AAAAAAAAAACx2Iw9"
      ],
      "weights": [
        "sXPSvqO0Dj5WRxC+oD3avoPtfj0uzo+88WPgPb/Voz5LFM0+oqG6vViHzj4WPoy+ABtPPPAEkrza1EE9ZVyqPhjigT7Xf4k8vO88vSFAmD44oZ28noQovt3IFj4D13U9P/ecPmCFeL52PEa+ippRPmAPhb2kBgg+P6qhvlKXOj6OYZo+L9ILPn6sQ77p8BA9dlFwvuuoDj45ysk+7HGTvog9qr7mC8w+yT0rvlBe+jzK89A+UoKOvkGJvz6uz+U9UpISvf94+D4wTr2+rS08PPNIGT4VbS0+E8D/PU5ikL6SWrI+GAMGPYS6pL5LACI9EP7qvAUJcL1gmIQ+SMIBPZX4nb6YYpA+IC/ZvWW5ND5OyaA+PfzQPkd5cD7Oeng+YtdpPmkLxT7zGvE9Rv4DvFRu976fpaQ+FXLnvUG/xL5Lopo90E+WvDsK9r3Heyy+WFCHvkAF3T76zg2/xnAxvgHlhj4siRK+pLP2vXRR0r7mjhs/vVdLO2WBQr52OvC+gPJIvsjl+DzUhhw+fMCFvlw/mz43S8m+2cHDvr8InD4yasS9IIvCPGU1L72xFYi+VW7xPgOJn7x4AXU9tyC5vv1v/T2bWoS+WR5Lvm9CmL5zdhU/xv4uPkgC/r025EC9gtKDvrHKOj4X7ua80eKvPqjdNT7UoJo+ZpcFPXGJ0T36kaa+fIqNvtePc75D19S9SkIdvrzFoL6QmY29Jf6NvqG8xj6Glm09013APrbijj0xBqA+CuYYPsqCtTtxMs0+pCnWvcAiqz0Ih+y9SoJsPtYtCr6+FYg+/k0MPvZupr5gdR89sjOPvXb3hD6TDAc+w9IXvmfLGL6qycs+EQcdvdeNvT68KEq9WhYevgiCnr7ow28+trLPvi4N7L5NoKo+G1r3vhVu2r5/kAS+NgpzPpGVn77/uAu8XIPNvuc28zzS2OW+kE0ZPfsItr5qMi++xOwcvrX+Jj6weC89RldEvXGd8r0wdmA+2Lq/Pns6A7q2KKw9QHievpuHWL6IzBQ9",
        "PR3BPgD3bjtAXl4+/vclvm0LYT5A2bA+6Wxcvs/vj75LA50+pMWTPQTyzz0+Jqe+1VlXvoockL2o55o+pho+PgBCqzqVk4+9QB0UvExRtj3ipWm+A0zTPsDoyrysbME9sH/SvrAwsb5GQrG+cA9mvb+psj4slFW+yI3KvvW8xT7thMS+2It2PW+TcL48aby+zc/MOjIXF7+ZLzI8c2KaPinGor5Epj49RigfPrxqor5/6VG+E+LSvmB31Txe76C+ZEERvl326b4yEdG8Wt27vvbI3z2ucVs8WV8/POrf+r64zCq+zhmBPu1AxD59tS+/oM8RvR9ztD6SvIQ+dWjQvvWzzr4UiZa+H3eSPQg+uj3LjyE+mlqivpR7wD0oi3s9yjLRvie5jj7fGsO9Vw+3vrq6KD5YiqA+brRdPkXQwL6gsVw9j3mYvmTOgb2AhjO7gLFpu7arPT6Q3cq+XQm+vkq0tr6CxYG+eQ7JPk1NTb7Vnqk+tHEOPlja0D6dt/q9abupPfVAdz65CSW+1lBHvoHr0j77j+G+PK+Gvt8zFj6H46A+auGnvtCniDwKRU0+"
      ]
    },
    "dense_3": {
      "bias": [
        "MC/2PC7nID0LHSQ9mmkgPU4zUDwy3iU9AAAAANajiznoY4q8ZK6IOw=="
      ],
      "weights": [
        "b4ivvhC8wr5a5/g8+yLHPHLVLj6+JgC+ddCdPkWB2z5EH60+0GG+PkjrEj95oqc+xtIxPjfEi74CpwO/vASrPs5pmr6IWbE8tNAGv/Ivor6S+R8+omjIvvXsAr9+5cu+easGPw0Fxj3w3ha+Q77NPvX1hr4Ay2++tCX+PrL1xD6I2ek+V1HtPin5mz5ydcg+mPV2PRoKhz5J0+M993EhvuflZzvgGwI/v5nrPkYu9z4ZEvY+vCN8PjBlkr1o+dm+qHukPQKryD7uDBo+RejkPr2M1z5PR7Y+YvDavsDMoL4Cd6y+TMiiPmOOAr++H7+9GJ+CPiQoM75pg6E9LSmNvYhdB74Waig+1q9FPn49Z77NDMO++RepvnCooz2cdaO85o2GPLsI5j6NB3G+WKSFPo5uD76KvcO+XUi9PrLYq76tHti+gIVXvgRPjL3dAkG+O6p1PtRZGL/8eYI91zTjvg+HBz6ODn6+hZ/ePbNf9b7jgzi99wmnPTJnaz25VA4+CDwPPSHMg76jXT+94HzEvmq8M7/nxNW+29FcPfCyMr6gMow+Fw+mPfa9Vz7zEmu8Xhm0PvQZGr7KPhE/fCh5vbHdKj+3GBq94P5pv7k/Oj+Rwos+a5fOPhaZd7/y4h2/vFKovg7/Sj7NLvi+a0b1vg1nh74s0oK+AFsKvca6hb5R8qk+GNoEvlQEJb5jbcI+g9WQPrzY571MuIM9xZe5Puthzj5AIqi+GZ/XvpqDcD42p8m7gqHvPvjnDLx9D6Y+QeeyOmxszjwA1OO9VEZUPhyJ2T70WFc+"
      ]
    },
    "dense_4": {
      "bias": [
        "9uwgPQ=="
      ],
      "weights": [
        "7Vv9PgAfwz6yjLs+hRY4P52T9L4grRM/KM6gPV2zIr+WhP6+MSZZvg=="
      ]
    }
  }
}
